var quotesData =[
  {
    "id": "current high school student",
    "quote": "This year we were taught about the concept of consent in school, but we didn't go deep into it at all. And the reaction from most of the boys in my grade made me nauseous. People came up to me after class saying things like, \"this is bullshit,\" like how one would react to a boring class or something.",
    "consent": "yes",
    "sexual assault": "yes",
    "sexual experiences": "",
    "sex education": "",
    "lgbtq": "",
    "improvements": ""
  },
  {
    "id": "current high school student",
    "quote": "There were two sexual assaults at my school this year, not physically at school but with students… and it just really makes me sick. No one seems bothered by it.",
    "consent": "yes",
    "sexual assault": "yes",
    "sexual experiences": "",
    "sex education": "",
    "lgbtq": "",
    "improvements": ""
  },
  {
    "id": "current high school student",
    "quote": "We didn't go deep into the idea of sexual assault. It felt like it was half-assed, and like the teachers and students alike were just uncomfortable…like it was something that they just kind of had to get done, you know? It's unrealistic, obviously, but I was hoping people would actually give a shit--both teachers and students.",
    "consent": "yes",
    "sexual assault": "yes",
    "sexual experiences": "",
    "sex education": "",
    "lgbtq": "",
    "improvements": ""
  },
  {
    "id": "current high school student",
    "quote": "I wish that [my school] hadn't just danced around [sexual assault], and been more like \"this is a real thing that happens\" … I just wish that it could've gone deeper.",
    "consent": "yes",
    "sexual assault": "yes",
    "sexual experiences": "",
    "sex education": "",
    "lgbtq": "",
    "improvements": ""
  },
  {
    "id": "current high school student",
    "quote": "Personally, my experiences have been weird with stuff in that area. Nothing bad, no one got hurt, it's just kind of this weird, untalked about thing.",
    "consent": "yes",
    "sexual assault": "",
    "sexual experiences": "yes",
    "sex education": "",
    "lgbtq": "",
    "improvements": ""
  },
  {
    "id": "current high school student",
    "quote": "I don't really have any formal education on [consent and sexual assault], but it's always meant a lot to me. I've had friends go through things like that and I suppose that exposure helped to teach me about it. That, and between my older siblings and social media accounts that are very vocal about things have probably helped to kind of like teach me.",
    "consent": "",
    "sexual assault": "",
    "sexual experiences": "yes",
    "sex education": "yes",
    "lgbtq": "",
    "improvements": ""
  },
  {
    "id": "current high school student",
    "quote": "I never really thought to actually research things, although maybe I should.",
    "consent": "",
    "sexual assault": "",
    "sexual experiences": "",
    "sex education": "yes",
    "lgbtq": "",
    "improvements": ""
  },
  {
    "id": "current middle school teacher",
    "quote": "Some rumor went around about my friend, and that's how I found out what fingering was.",
    "consent": "",
    "sexual assault": "",
    "sexual experiences": "",
    "sex education": "yes",
    "lgbtq": "",
    "improvements": ""
  },
  {
    "id": "current middle school teacher",
    "quote": "If you don't even know what to ask, your questions can't be answered.",
    "consent": "",
    "sexual assault": "",
    "sexual experiences": "",
    "sex education": "yes",
    "lgbtq": "",
    "improvements": ""
  },
  {
    "id": "current middle school teacher",
    "quote": "When you don't even know what half of the actions are, or how things work, it makes it very scary when you try them! It wasn't sexy to me, it was intimidating. I felt like I fucked up everytime. And I think that's where you get a lot of that grey area of, \"was it consensual or not?\" because you don't exactly expect that thing to happen. Then you feel taken advantage of because a line was crossed, and you didn't know how to stop it because it was already happening.",
    "consent": "yes",
    "sexual assault": "",
    "sexual experiences": "yes",
    "sex education": "yes",
    "lgbtq": "",
    "improvements": ""
  },
  {
    "id": "current middle school teacher",
    "quote": "When I was in school, we had \"health education\" in 8th grade and once in high school. Oral sex wasn't covered, and so I didn't even know that guys go down on girls.",
    "consent": "",
    "sexual assault": "",
    "sexual experiences": "",
    "sex education": "yes",
    "lgbtq": "",
    "improvements": ""
  },
  {
    "id": "current middle school teacher",
    "quote": "The middle schoolers are definitely sexually active and need to be educated about it! No matter how many times I bring it up [to administrators] nothing ever comes out of it.",
    "consent": "",
    "sexual assault": "",
    "sexual experiences": "",
    "sex education": "yes",
    "lgbtq": "",
    "improvements": ""
  },
  {
    "id": "former peer sex educator in college",
    "quote": "One of the most common responses we got would happen during our \"down there\" workshop. Sexually active adults would look at a diagram of the vulva and say, \"it has hair?!\" In most textbooks the vulva has no clitoris and no hair, so they have no idea what it naturally looks like.",
    "consent": "",
    "sexual assault": "",
    "sexual experiences": "",
    "sex education": "yes",
    "lgbtq": "",
    "improvements": ""
  },
  {
    "id": "former peer sex educator in college",
    "quote": "Often, students couldn't properly identify their experiences as being sexual assault because they weren't taught about it at all",
    "consent": "yes",
    "sexual assault": "yes",
    "sexual experiences": "yes",
    "sex education": "yes",
    "lgbtq": "",
    "improvements": ""
  },
  {
    "id": "former peer sex educator in college",
    "quote": "I've heard of so many different types of demonstrations for why to abstain: dirty socks, tape that's been reused, ultimately something that gets used and therefore gets dirty over time. When that's been ingrained in your brain for so long, you can't just unlearn that, especially with something so intimate.",
    "consent": "",
    "sexual assault": "",
    "sexual experiences": "",
    "sex education": "yes",
    "lgbtq": "",
    "improvements": ""
  },
  {
    "id": "current college student",
    "quote": "I learned nothing in school about sexual education and sexual harassment in general. It wasn't until college orientation where I learned anything about consent, which was mostly through watching awkward videos with a crowd of hundreds of students.",
    "consent": "",
    "sexual assault": "",
    "sexual experiences": "",
    "sex education": "",
    "lgbtq": "",
    "improvements": ""
  },
  {
    "id": "current college student",
    "quote": "Due to not getting accurate information [in high school or prior], I was left on my own to figure out most things myself since my sex education was essentially watching the meaning of life video, which was just seeing a baby being born. We never went over STD prevention nor talked about the AIDs crisis which marginally affected those in the Queer community [of which I am a member]",
    "consent": "",
    "sexual assault": "",
    "sexual experiences": "",
    "sex education": "yes",
    "lgbtq": "yes",
    "improvements": ""
  },
  {
    "id": "current college student",
    "quote": "As someone who identifies as Queer, I find it to be incredibly problematic that sex education is just taught from a heterosexual perspective and does not recognize sexuality as a spectrum.",
    "consent": "",
    "sexual assault": "",
    "sexual experiences": "",
    "sex education": "yes",
    "lgbtq": "yes",
    "improvements": ""
  },
  {
    "id": "current college student",
    "quote": "My friends have been fantastic enough to help me out a ton. During my process of questioning, they made me feel comfortable to be completely open with them about how I was feeling and were willing to answer any questions. I got really lucky and I know that not everyone had the same resources that I do.",
    "consent": "",
    "sexual assault": "",
    "sexual experiences": "",
    "sex education": "yes",
    "lgbtq": "yes",
    "improvements": ""
  },
  {
    "id": "recent college graduate",
    "quote": "I'm not shocked about the [sexual assault] epidemic because we were never taught what it was like to be unsure, or not okay with a sexual situation. The only thing I was taught was to keep my drink close, keys between my fingers, and carry Mace.",
    "consent": "yes",
    "sexual assault": "yes",
    "sexual experiences": "",
    "sex education": "yes",
    "lgbtq": "",
    "improvements": ""
  },
  {
    "id": "recent college graduate",
    "quote": "I went through health classes in public school and private school, but both failed to give good education on this topic. My parents tried to help but most of my knowledge came through my own research and talking with other people about their experiences... Another way I learned was through being in Europe, they talk about sex and love so openly that it was kind of a shock but also an eye opener.",
    "consent": "",
    "sexual assault": "",
    "sexual experiences": "",
    "sex education": "yes",
    "lgbtq": "",
    "improvements": ""
  },
  {
    "id": "current high school teacher",
    "quote": "Based on what I've heard from students, I don't think schools have bought into the idea of directly and explicitly teaching consent and what is acceptable social behavior regarding sex. I think there is still a lot, and too much, teaching young women how to avoid being assaulted and raped, and not nearly enough education for young men on what is considered assault or rape and how/why to not do it.",
    "consent": "yes",
    "sexual assault": "yes",
    "sexual experiences": "",
    "sex education": "yes",
    "lgbtq": "",
    "improvements": ""
  },
  {
    "id": "current high school teacher",
    "quote": "My professional theory on why this is stems from experience teaching \"controversial\" things…: it's still too polarized. Teachers are already on thin ice with parents and administrators, even if they have never been \"written up.\" Administrators want to finish up their careers as smoothly as possible. Teachers are too burned out to want to deal with the one (or few) parents who will complain that teaching their son...not to rape is offensive. That the teacher should be teaching the girls how to not \"ask for it.\" (Just saying that disgusts me, by the way.)",
    "consent": "yes",
    "sexual assault": "yes",
    "sexual experiences": "",
    "sex education": "yes",
    "lgbtq": "",
    "improvements": ""
  },
  {
    "id": "current high school teacher",
    "quote": "I think that because of the Internet, social media, just the world in general, sex is literally all around us now. We say that it was [like this] when we were in high school, and that's true, but imagine that times 100. I think the majority of kids want to have conversations about consent and general sexual behavior.",
    "consent": "yes",
    "sexual assault": "yes",
    "sexual experiences": "",
    "sex education": "yes",
    "lgbtq": "",
    "improvements": ""
  },
  {
    "id": "current high school teacher",
    "quote": "I wish that sex ed would balance consent and sexual health/safety a bit more. I think teachers breeze by it because it's a difficult topic to teach and they're afraid of \"getting in trouble.\" We live in a much more litigious world now.",
    "consent": "yes",
    "sexual assault": "",
    "sexual experiences": "",
    "sex education": "yes",
    "lgbtq": "",
    "improvements": ""
  },
  {
    "id": "current high school teacher",
    "quote": "…I think about if my school were just like, \"we're going to teach that boys are responsible for their actions and it's not the girls' fault,\" and I can just imagine the uproar from the parents because the school is attacking the innocent white boys.",
    "consent": "yes",
    "sexual assault": "yes",
    "sexual experiences": "",
    "sex education": "yes",
    "lgbtq": "",
    "improvements": ""
  },
  {
    "id": "current working professional",
    "quote": "I don't remember sex ed very well to be honest. I know we did it in seventh grade, and there was definitely talk of condoms and birth-control but definitely no bananas as seen on TV. But what I do remember is that everything was centered around penetrative sex. With the penis near literally the center of the whole lesson. There is, of course, nothing wrong with that area of sexual education--it's incredibly important...But by [only focusing on penetrative sex] it doesn't include so many aspects of the conversation.",
    "consent": "",
    "sexual assault": "",
    "sexual experiences": "",
    "sex education": "yes",
    "lgbtq": "yes",
    "improvements": ""
  },
  {
    "id": "current working professional",
    "quote": "The best education I had, whether in school or in life, came from conversations rooted in nuance and an exploration to understanding. I think sex ed needs to be much more of a conversation. It could be about bodies, understanding our bodies, understanding pleasure, and understanding that all of these arenas are super nuanced and connected. How do you do that while also presenting facts? If I had to take a stab at it (I am, of course, not a teacher) I would say present the “facts” but then immediately follow up with all the different ways that these facts can be true to different people. Because, in all likelihood, there is going to be a kid in a teacher's class... at some point who is for example, asexual and isn’t experiencing sexual feelings in the same way as their peers and doesn’t know how to communicate that.",
    "consent": "",
    "sexual assault": "",
    "sexual experiences": "",
    "sex education": "yes",
    "lgbtq": "yes",
    "improvements": ""
  },
  {
    "id": "current working professional",
    "quote": "I think most importantly, by making the conversation be that \"sex\" is the umbrella term rather than an act could be the biggest game changer. By framing it this way, it allows for the possibility for students to see and understand all the facets that come with their sexuality and their desire and how that lives in context with their relationship to their bodies. A teacher could hopefully then have an easier time talking about all the different ways bodies can feel pleasure whether alone or with a partner (or partners) and all the ways they can be the most healthy in doing so. It then opens the context to students that sex is not just one act that happens with a body that is the “opposite” to theirs because bodies and gender and sexual acts and pleasure and sensuality are way more interesting and complex than the world tries to say they are!",
    "consent": "",
    "sexual assault": "",
    "sexual experiences": "",
    "sex education": "yes",
    "lgbtq": "yes",
    "improvements": ""
  },
  {
    "id": "",
    "quote": "",
    "consent": "",
    "sexual assault": "",
    "sexual experiences": "",
    "sex education": "",
    "lgbtq": "",
    "improvements": ""
  }
];